; domain
(define (domain emergencia)
  (:requirements :strips :typing)

  (:types
    location
    person
    crate
    content
    drone
  )

  (:predicates
    (at-drone ?d - drone ?l - location)
    (at-person ?p - person ?l - location)
    (at-crate ?c - crate ?l - location)

    (has-content ?c - crate ?con - content)
    (has ?p - person ?con - content)

    (free-arm1 ?d - drone)
    (free-arm2 ?d - drone)

    (carrying-arm1 ?d - drone ?c - crate)
    (carrying-arm2 ?d - drone ?c - crate)

    (available ?c - crate)
  )

  (:action fly
    :parameters (?d - drone ?from - location ?to - location)
    :precondition
      (at-drone ?d ?from)
    :effect
      (and
        (not (at-drone ?d ?from))
        (at-drone ?d ?to)
      )
  )

  (:action pickup-arm1
    :parameters (?d - drone ?c - crate ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-crate ?c ?l)
        (free-arm1 ?d)
        (available ?c)
      )
    :effect
      (and
        (not (at-crate ?c ?l))
        (not (free-arm1 ?d))
        (not (available ?c))
        (carrying-arm1 ?d ?c)
      )
  )

  (:action pickup-arm2
    :parameters (?d - drone ?c - crate ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-crate ?c ?l)
        (free-arm2 ?d)
        (available ?c)
      )
    :effect
      (and
        (not (at-crate ?c ?l))
        (not (free-arm2 ?d))
        (not (available ?c))
        (carrying-arm2 ?d ?c)
      )
  )

  (:action deliver-arm1
    :parameters (?d - drone ?c - crate ?p - person ?con - content ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-person ?p ?l)
        (carrying-arm1 ?d ?c)
        (has-content ?c ?con)
      )
    :effect
      (and
        (not (carrying-arm1 ?d ?c))
        (free-arm1 ?d)
        (has ?p ?con)
      )
  )

  (:action deliver-arm2
    :parameters (?d - drone ?c - crate ?p - person ?con - content ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-person ?p ?l)
        (carrying-arm2 ?d ?c)
        (has-content ?c ?con)
      )
    :effect
      (and
        (not (carrying-arm2 ?d ?c))
        (free-arm2 ?d)
        (has ?p ?con)
      )
  )
)

; problem
(define (problem drone_problem_d1_r0_l17_p17_c17_g17_ct2)
(:domain emergencia)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
)
(:init
	(at-drone drone1 depot)
	(free-arm1 drone1)
	(free-arm2 drone1)
	(at-crate crate1 depot)
	(available crate1)
	(at-crate crate2 depot)
	(available crate2)
	(at-crate crate3 depot)
	(available crate3)
	(at-crate crate4 depot)
	(available crate4)
	(at-crate crate5 depot)
	(available crate5)
	(at-crate crate6 depot)
	(available crate6)
	(at-crate crate7 depot)
	(available crate7)
	(at-crate crate8 depot)
	(available crate8)
	(at-crate crate9 depot)
	(available crate9)
	(at-crate crate10 depot)
	(available crate10)
	(at-crate crate11 depot)
	(available crate11)
	(at-crate crate12 depot)
	(available crate12)
	(at-crate crate13 depot)
	(available crate13)
	(at-crate crate14 depot)
	(available crate14)
	(at-crate crate15 depot)
	(available crate15)
	(at-crate crate16 depot)
	(available crate16)
	(at-crate crate17 depot)
	(available crate17)
	(has-content crate1 food)
	(has-content crate2 food)
	(has-content crate3 food)
	(has-content crate4 food)
	(has-content crate5 food)
	(has-content crate6 food)
	(has-content crate7 food)
	(has-content crate8 food)
	(has-content crate9 food)
	(has-content crate10 food)
	(has-content crate11 food)
	(has-content crate12 food)
	(has-content crate13 food)
	(has-content crate14 medicine)
	(has-content crate15 medicine)
	(has-content crate16 medicine)
	(has-content crate17 medicine)
	(at-person person1 loc8)
	(at-person person2 loc2)
	(at-person person3 loc3)
	(at-person person4 loc1)
	(at-person person5 loc4)
	(at-person person6 loc7)
	(at-person person7 loc4)
	(at-person person8 loc13)
	(at-person person9 loc3)
	(at-person person10 loc12)
	(at-person person11 loc4)
	(at-person person12 loc2)
	(at-person person13 loc1)
	(at-person person14 loc7)
	(at-person person15 loc6)
	(at-person person16 loc4)
	(at-person person17 loc16)
)
(:goal (and
	(at-drone drone1 depot)
	(has person2 food)
	(has person3 food)
	(has person3 medicine)
	(has person4 food)
	(has person5 food)
	(has person7 food)
	(has person7 medicine)
	(has person8 food)
	(has person9 food)
	(has person10 food)
	(has person11 food)
	(has person14 food)
	(has person14 medicine)
	(has person15 food)
	(has person15 medicine)
	(has person16 food)
	(has person17 food)
	))
)

; plan
1. (pickup-arm2 drone1 crate17 depot)
   deleted: (at-crate crate17 depot) (free-arm2 drone1) (available crate17)
   added: (carrying-arm2 drone1 crate17)
   goals met: 1 of 18
2. (pickup-arm1 drone1 crate13 depot)
   deleted: (at-crate crate13 depot) (free-arm1 drone1) (available crate13)
   added: (carrying-arm1 drone1 crate13)
   goals met: 1 of 18
3. (fly drone1 depot loc16)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc16)
   goals met: 0 of 18
4. (deliver-arm1 drone1 crate13 person17 food loc16)
   deleted: (carrying-arm1 drone1 crate13)
   added: (free-arm1 drone1) (has person17 food)
   goals met: 1 of 18
5. (fly drone1 loc16 depot)
   deleted: (at-drone drone1 loc16)
   added: (at-drone drone1 depot)
   goals met: 2 of 18
6. (pickup-arm1 drone1 crate12 depot)
   deleted: (at-crate crate12 depot) (free-arm1 drone1) (available crate12)
   added: (carrying-arm1 drone1 crate12)
   goals met: 2 of 18
7. (fly drone1 depot loc13)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc13)
   goals met: 1 of 18
8. (deliver-arm1 drone1 crate12 person8 food loc13)
   deleted: (carrying-arm1 drone1 crate12)
   added: (free-arm1 drone1) (has person8 food)
   goals met: 2 of 18
9. (fly drone1 loc13 depot)
   deleted: (at-drone drone1 loc13)
   added: (at-drone drone1 depot)
   goals met: 3 of 18
10. (pickup-arm1 drone1 crate11 depot)
   deleted: (at-crate crate11 depot) (free-arm1 drone1) (available crate11)
   added: (carrying-arm1 drone1 crate11)
   goals met: 3 of 18
11. (fly drone1 depot loc12)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc12)
   goals met: 2 of 18
12. (deliver-arm1 drone1 crate11 person10 food loc12)
   deleted: (carrying-arm1 drone1 crate11)
   added: (free-arm1 drone1) (has person10 food)
   goals met: 3 of 18
13. (fly drone1 loc12 depot)
   deleted: (at-drone drone1 loc12)
   added: (at-drone drone1 depot)
   goals met: 4 of 18
14. (pickup-arm1 drone1 crate10 depot)
   deleted: (at-crate crate10 depot) (free-arm1 drone1) (available crate10)
   added: (carrying-arm1 drone1 crate10)
   goals met: 4 of 18
15. (fly drone1 depot loc2)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc2)
   goals met: 3 of 18
16. (deliver-arm1 drone1 crate10 person2 food loc2)
   deleted: (carrying-arm1 drone1 crate10)
   added: (free-arm1 drone1) (has person2 food)
   goals met: 4 of 18
17. (fly drone1 loc2 depot)
   deleted: (at-drone drone1 loc2)
   added: (at-drone drone1 depot)
   goals met: 5 of 18
18. (pickup-arm1 drone1 crate9 depot)
   deleted: (at-crate crate9 depot) (free-arm1 drone1) (available crate9)
   added: (carrying-arm1 drone1 crate9)
   goals met: 5 of 18
19. (fly drone1 depot loc1)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc1)
   goals met: 4 of 18
20. (deliver-arm1 drone1 crate9 person4 food loc1)
   deleted: (carrying-arm1 drone1 crate9)
   added: (free-arm1 drone1) (has person4 food)
   goals met: 5 of 18
21. (fly drone1 loc1 depot)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 depot)
   goals met: 6 of 18
22. (pickup-arm1 drone1 crate8 depot)
   deleted: (at-crate crate8 depot) (free-arm1 drone1) (available crate8)
   added: (carrying-arm1 drone1 crate8)
   goals met: 6 of 18
23. (fly drone1 depot loc7)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc7)
   goals met: 5 of 18
24. (deliver-arm2 drone1 crate17 person14 medicine loc7)
   deleted: (carrying-arm2 drone1 crate17)
   added: (free-arm2 drone1) (has person14 medicine)
   goals met: 6 of 18
25. (deliver-arm1 drone1 crate8 person14 food loc7)
   deleted: (carrying-arm1 drone1 crate8)
   added: (free-arm1 drone1) (has person14 food)
   goals met: 7 of 18
26. (fly drone1 loc7 depot)
   deleted: (at-drone drone1 loc7)
   added: (at-drone drone1 depot)
   goals met: 8 of 18
27. (pickup-arm2 drone1 crate16 depot)
   deleted: (at-crate crate16 depot) (free-arm2 drone1) (available crate16)
   added: (carrying-arm2 drone1 crate16)
   goals met: 8 of 18
28. (pickup-arm1 drone1 crate7 depot)
   deleted: (at-crate crate7 depot) (free-arm1 drone1) (available crate7)
   added: (carrying-arm1 drone1 crate7)
   goals met: 8 of 18
29. (fly drone1 depot loc6)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc6)
   goals met: 7 of 18
30. (deliver-arm2 drone1 crate16 person15 medicine loc6)
   deleted: (carrying-arm2 drone1 crate16)
   added: (free-arm2 drone1) (has person15 medicine)
   goals met: 8 of 18
31. (deliver-arm1 drone1 crate7 person15 food loc6)
   deleted: (carrying-arm1 drone1 crate7)
   added: (free-arm1 drone1) (has person15 food)
   goals met: 9 of 18
32. (fly drone1 loc6 depot)
   deleted: (at-drone drone1 loc6)
   added: (at-drone drone1 depot)
   goals met: 10 of 18
33. (pickup-arm2 drone1 crate15 depot)
   deleted: (at-crate crate15 depot) (free-arm2 drone1) (available crate15)
   added: (carrying-arm2 drone1 crate15)
   goals met: 10 of 18
34. (pickup-arm1 drone1 crate6 depot)
   deleted: (at-crate crate6 depot) (free-arm1 drone1) (available crate6)
   added: (carrying-arm1 drone1 crate6)
   goals met: 10 of 18
35. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 9 of 18
36. (deliver-arm2 drone1 crate15 person7 medicine loc4)
   deleted: (carrying-arm2 drone1 crate15)
   added: (free-arm2 drone1) (has person7 medicine)
   goals met: 10 of 18
37. (fly drone1 loc4 depot)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 depot)
   goals met: 11 of 18
38. (pickup-arm2 drone1 crate14 depot)
   deleted: (at-crate crate14 depot) (free-arm2 drone1) (available crate14)
   added: (carrying-arm2 drone1 crate14)
   goals met: 11 of 18
39. (fly drone1 depot loc3)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc3)
   goals met: 10 of 18
40. (deliver-arm2 drone1 crate14 person3 medicine loc3)
   deleted: (carrying-arm2 drone1 crate14)
   added: (free-arm2 drone1) (has person3 medicine)
   goals met: 11 of 18
41. (deliver-arm1 drone1 crate6 person3 food loc3)
   deleted: (carrying-arm1 drone1 crate6)
   added: (free-arm1 drone1) (has person3 food)
   goals met: 12 of 18
42. (fly drone1 loc3 depot)
   deleted: (at-drone drone1 loc3)
   added: (at-drone drone1 depot)
   goals met: 13 of 18
43. (pickup-arm2 drone1 crate5 depot)
   deleted: (at-crate crate5 depot) (free-arm2 drone1) (available crate5)
   added: (carrying-arm2 drone1 crate5)
   goals met: 13 of 18
44. (pickup-arm1 drone1 crate4 depot)
   deleted: (at-crate crate4 depot) (free-arm1 drone1) (available crate4)
   added: (carrying-arm1 drone1 crate4)
   goals met: 13 of 18
45. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 12 of 18
46. (deliver-arm2 drone1 crate5 person5 food loc4)
   deleted: (carrying-arm2 drone1 crate5)
   added: (free-arm2 drone1) (has person5 food)
   goals met: 13 of 18
47. (deliver-arm1 drone1 crate4 person7 food loc4)
   deleted: (carrying-arm1 drone1 crate4)
   added: (free-arm1 drone1) (has person7 food)
   goals met: 14 of 18
48. (fly drone1 loc4 depot)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 depot)
   goals met: 15 of 18
49. (pickup-arm2 drone1 crate3 depot)
   deleted: (at-crate crate3 depot) (free-arm2 drone1) (available crate3)
   added: (carrying-arm2 drone1 crate3)
   goals met: 15 of 18
50. (pickup-arm1 drone1 crate2 depot)
   deleted: (at-crate crate2 depot) (free-arm1 drone1) (available crate2)
   added: (carrying-arm1 drone1 crate2)
   goals met: 15 of 18
51. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 14 of 18
52. (deliver-arm2 drone1 crate3 person11 food loc4)
   deleted: (carrying-arm2 drone1 crate3)
   added: (free-arm2 drone1) (has person11 food)
   goals met: 15 of 18
53. (deliver-arm1 drone1 crate2 person16 food loc4)
   deleted: (carrying-arm1 drone1 crate2)
   added: (free-arm1 drone1) (has person16 food)
   goals met: 16 of 18
54. (fly drone1 loc4 depot)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 depot)
   goals met: 17 of 18
55. (pickup-arm2 drone1 crate1 depot)
   deleted: (at-crate crate1 depot) (free-arm2 drone1) (available crate1)
   added: (carrying-arm2 drone1 crate1)
   goals met: 17 of 18
56. (fly drone1 depot loc3)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc3)
   goals met: 16 of 18
57. (deliver-arm2 drone1 crate1 person9 food loc3)
   deleted: (carrying-arm2 drone1 crate1)
   added: (free-arm2 drone1) (has person9 food)
   goals met: 17 of 18
58. (fly drone1 loc3 depot)
   deleted: (at-drone drone1 loc3)
   added: (at-drone drone1 depot)
   goals met: 18 of 18
